liuchaoyuliu/stm32-onenet-iot/user/main.c
#include "stm32f10x.h"
#include "FreeRTOS.h"
#include "task.h"
#include "bsp_usart.h"
#include "bsp_esp8266.h"
#include "key.h"
#include "lcd.h"
#include "delay.h"
#include "semphr.h"
#include "led.h"
#include "cJSON.h"
#include <stdio.h>
#include <string.h>
#include "MqttKit.h"
#include "Net_Status.h"
//#include "upload_task.h"
#include "dht11.h"
#include  "beep.h"
#include "display_task.h"
#include "key_task.h"
#include "sensor_data.h"
// ================================================================
// ===== 调试开关 =====
// ================================================================
#define DEBUG_MONITOR_ENABLE   1   // 1=开启监控任务，0=关闭
extern void LCD_ShowChineseString16(u16 x, u16 y, const char *str, u16 color);
// ================================================================
// ===== 断线统计 =====
// ================================================================
uint32_t g_wifi_lost_count = 0;        // WiFi 断线次数
uint32_t g_mqtt_pingresp_timeout = 0;  // PINGRESP 超时次数
uint32_t g_mqtt_reconnect_count = 0;   // MQTT 重连次数
// ================================================================
// ===== 重连指数退避 =====
// ================================================================
uint32_t g_reconnect_delay = 5;   // 初始重连间隔 5 秒，失败后翻倍，最大 60 秒
// ================================================================
// ===== 时间间隔宏定义 =====
// ================================================================
#define WIFI_CHECK_INTERVAL_MS    30000   // WiFi 状态查询间隔：30 秒
#define PING_INTERVAL_MS          30000   // MQTT 心跳间隔：30 秒
#define PINGRESP_TIMEOUT_MS       90000   // PINGRESP 超时阈值：90 秒
#define SENSOR_INTERVAL_MS        5000    // 传感器采集间隔：5 秒
#define STATS_PRINT_INTERVAL_MS   60000   // 断线统计打印间隔：60 秒  
#define UPLOAD_INTERVAL_MS    10000       //温湿度上传间隔10秒 
// ================================================================
// ===== 任务句柄 =====
// ================================================================
TaskHandle_t xNetworkTaskHandle = NULL;       // WiFi 任务句柄
TaskHandle_t xParserTaskHandle = NULL;     // MQTT 解析任务句柄
TaskHandle_t xMonitorTaskHandle = NULL;    // 监控任务句柄
TaskHandle_t xSensorTaskHandle = NULL;//传感器任务句柄
// ================================================================
// ===== 心跳时间戳 =====
// ================================================================
TickType_t g_last_ping_resp_time;   // 最后一次收到 PINGRESP 的时间戳
// ================================================================
// ===== MQTT Topic 定义 =====
// ================================================================
#define TOPIC_PROPERTY_POST   "$sys/SQ8gfZ73EX/Test1/thing/property/post"
#define TOPIC_PROPERTY_SET   "$sys/SQ8gfZ73EX/Test1/thing/property/set"   // 属性设置 Topic（订阅）
const char *Topic_property_set_reply = "$sys/SQ8gfZ73EX/Test1/thing/property/set_reply";   // 属性设置回复 Topic（发布）
void System_Init(void)
{
    delay_init();
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    Usart_Init();
    ESP8266_Init();
    KEY_Init();
    LCD_Init();
    LED_Init();
    DHT11_Init();
    BEEP_Init();
     // ★★★ 初始化 cJSON 内存钩子 ★★★
    cJSON_Hooks hooks;
    hooks.malloc_fn = pvPortMalloc;   // FreeRTOS 的 malloc
    hooks.free_fn   = vPortFree;      // FreeRTOS 的 free
    cJSON_InitHooks(&hooks);
    
    UsartPrintf(USART1, "[cJSON] Hooks installed, heap: %d\r\n", xPortGetFreeHeapSize());
}
// ================================================================
// wifi_manager.c 或 main.c 中
// ================================================================
/**
 * @brief FreeRTOS 栈溢出钩子函数
 * @param xTask 溢出任务句柄
 * @param pcTaskName 溢出任务名称
 * @note  当任何任务栈溢出时，FreeRTOS 会调用此函数
 */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    // ★ 关闭中断，防止其他任务继续运行
    taskDISABLE_INTERRUPTS();
    
    // ★ 打印溢出任务名（如果串口还能用）
    UsartPrintf(USART1, "\r\n[FATAL] Stack overflow in task: %s\r\n", pcTaskName);
    
    
    while (1) {
        BEEP=BEEP_ON;
        for (volatile uint32_t i = 0; i < 1000000; i++);  // 简单延时
        BEEP=BEEP_OFF;
    }
}
/**
 * @brief WiFi + MQTT 连接管理任务（状态机版）
 * 
 * @note 职责：
 *       1. 管理 WiFi 连接（连接、断线检测、重连）
 *       2. 管理 MQTT 连接（连接、订阅、心跳、断线重连）
 *       3. 维护全局网络状态 g_net_status
 *       4. 定期打印断线统计
 * 
 * @note 状态流转：
 *       DISCONNECTED → (WiFi连接成功) → CONNECTING
 *       CONNECTING   → (收到CONNACK)   → CONNECTED
 *       CONNECTED    → (WiFi断线/Ping失败/心跳超时) → DISCONNECTED / CONNECTING
 * 
 * @note 状态说明：
 *       NET_STATUS_DISCONNECTED：WiFi 未连接，尝试连接 WiFi
 *       NET_STATUS_CONNECTING：  WiFi 已连接，MQTT 连接中
 *       NET_STATUS_CONNECTED：   全部就绪，可收发数据
 * 
 * @note 重连策略：
 *       指数退避：5 → 10 → 20 → 40 → 60 秒（最大 60 秒）
 *       连接成功后重置为 5 秒
 */
void Network_Task(void *pvParameters)
{
    char ip[20];                    // IP 地址缓冲区（预留）
    uint32_t retry_count = 0;       // WiFi 连接重试次数
    UsartPrintf(USART1, "\r\n========================================\r\n");
    UsartPrintf(USART1, "[Network_Task] Started!\r\n");
    UsartPrintf(USART1, "SSID: %s\r\n", WIFI_SSID);
    UsartPrintf(USART1, "========================================\r\n"); 
    // ★ 初始状态：WiFi 未连接
    g_net_status = NET_STATUS_DISCONNECTED;
    
    while(1)
    {
        switch(g_net_status)
        {
            /* ============================================================
             * 状态1：DISCONNECTED — WiFi 未连接，尝试连接 WiFi
             * ============================================================ */
            case NET_STATUS_DISCONNECTED:
                UsartPrintf(USART1, "\r\n[WiFi] Connecting... (Attempt %d)\r\n", ++retry_count);
                
                // ★ 调用 ESP8266 连接 WiFi
                if (ESP8266_ConnectWiFi(WIFI_SSID, WIFI_PASSWORD)) {
                    retry_count = 0;
                    UsartPrintf(USART1, "[WiFi] Connected and got IP!\r\n");
                    // ★ WiFi 连接成功，切换到 CONNECTING（去连 MQTT）
                    g_net_status = NET_STATUS_CONNECTING;
                } else {
                    // ★ 连接失败，等 5 秒重试
                    UsartPrintf(USART1, "[WiFi] Connect failed! Retry after 5s\r\n");
                    vTaskDelay(pdMS_TO_TICKS(5000));
                }
                break;
            
            /* ============================================================
             * 状态2：CONNECTING — WiFi 已连接，MQTT 连接中
             * ============================================================ */
            case NET_STATUS_CONNECTING:
                UsartPrintf(USART1, "\r\n[MQTT] Connecting... (Count: %d)\r\n", ++g_mqtt_reconnect_count);
                if (!ESP8266_GetWiFiStatus()) {
                        // ★ WiFi 断线，触发重连
                        UsartPrintf(USART1, "\r\n[WiFi] Connection lost! (Count: %d)\r\n", ++g_wifi_lost_count);
                        g_net_status = NET_STATUS_DISCONNECTED;
                        subscribed = 0;
                        break;
                    }
                // ★ 只发送 MQTT CONNECT，不等待 CONNACK
                // CONNACK 由 ESP8266_MQTT_ParserTask 异步处理
                if (ESP8266_MQTT_Connect(ONENET_PRODID, ONENET_DEVNAME, ONENET_APIKEY)) {
                    UsartPrintf(USART1, "[MQTT] CONNECT sent, waiting CONNACK...\r\n");
                } else {
                    UsartPrintf(USART1, "[MQTT] Send CONNECT failed, retry 5s\r\n");
                }
                
                // ★ 指数退避：5 → 10 → 20 → 40 → 60（最大 60 秒）
                vTaskDelay(pdMS_TO_TICKS(g_reconnect_delay * 1000));
                g_reconnect_delay *= 2;
                if (g_reconnect_delay > 60) g_reconnect_delay = 60;
                break;
            
            /* ============================================================
             * 状态3：CONNECTED — 全部就绪，维持心跳 + 检测断线
             * ============================================================ */
            case NET_STATUS_CONNECTED:
                vTaskDelay(pdMS_TO_TICKS(2000));
                
