liuchaoyuliu/stm32-onenet-iot/user/main.c
                // ★ 检查 WiFi 状态（每 WIFI_CHECK_INTERVAL_MS 毫秒一次）
                static TickType_t last_wifi_check = 0;
                TickType_t now = xTaskGetTickCount();
                
                if (now - last_wifi_check > pdMS_TO_TICKS(WIFI_CHECK_INTERVAL_MS)) {
                    last_wifi_check = now;
                    
                    if (!ESP8266_GetWiFiStatus()) {
                        // ★ WiFi 断线，触发重连
                        UsartPrintf(USART1, "\r\n[WiFi] Connection lost! (Count: %d)\r\n", ++g_wifi_lost_count);
                        g_net_status = NET_STATUS_DISCONNECTED;
                        subscribed = 0;
                        break;
                    }
                }
                
                // ★ 检查 PINGRESP 超时（超过 PINGRESP_TIMEOUT_MS 毫秒没收到心跳回应）
                now = xTaskGetTickCount();
                if (now - g_last_ping_resp_time > pdMS_TO_TICKS(PINGRESP_TIMEOUT_MS)) {
                    UsartPrintf(USART1, "[MQTT] PINGRESP timeout! (Count: %d)\r\n", ++g_mqtt_pingresp_timeout);
                    g_net_status = NET_STATUS_CONNECTING;
                    subscribed = 0;  // ★ 超时时重置订阅标志
                    break;
                }
                
                // ★★★ 订阅主题（每次进入 CONNECTED 且未订阅时执行） ★★★
                if (!subscribed) {
                    UsartPrintf(USART1, "[MQTT] Subscribing...\r\n");
                    if (ESP8266_MQTT_Subscribe(TOPIC_PROPERTY_SET, 0)) {
                        UsartPrintf(USART1, "[MQTT] Subscribe OK\r\n");
                    } else {
                        UsartPrintf(USART1, "[MQTT] Subscribe FAILED, retry next loop\r\n");
                    }
                }
                
                // ★ 每 PING_INTERVAL_MS 毫秒发一次 MQTT 心跳
                static TickType_t last_ping_time = 0;
                now = xTaskGetTickCount();
                if (now - last_ping_time > pdMS_TO_TICKS(PING_INTERVAL_MS)) {
                    if (!ESP8266_MQTT_Ping()) {
                        UsartPrintf(USART1, "[MQTT] Ping send failed\r\n");
                        g_net_status = NET_STATUS_CONNECTING;
                        subscribed = 0;  // ★ Ping失败时重置订阅标志
                    } else {
                        last_ping_time = now;
                    }
                }
                // ★ 5. 数据上传
                static TickType_t last_upload_time = 0;
                now=xTaskGetTickCount();
                if (now - last_upload_time > pdMS_TO_TICKS(UPLOAD_INTERVAL_MS)) {
                    last_upload_time = now;

                    if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                        int temp = g_sensorData.temp_int;
                        int humi = g_sensorData.humi_int;
                        uint8_t led = g_sensorData.led_flag;
                        uint8_t alarm = g_sensorData.alarm_flag;
                        xSemaphoreGive(g_dataMutex);

                        char payload[256];
                        sprintf(payload,
                                "{\"id\":\"123\",\"params\":{"
                                "\"Temp\":{\"value\":%d},"
                                "\"Hum\":{\"value\":%d},"
                                "\"Led\":{\"value\":%s},"
                                "\"Alarm\":{\"value\":%s}"
                                "}}",
                                temp, humi,
                                led ? "true" : "false",
                                alarm ? "true" : "false");

                        UsartPrintf(USART1, "[Upload] %s\r\n", payload);

                        if (!ESP8266_MQTT_Publish(TOPIC_PROPERTY_POST, payload, 0)) {
                            if (!ESP8266_MQTT_Publish(TOPIC_PROPERTY_POST, payload, 0)) {
                                UsartPrintf(USART1, "[Upload] FAILED\r\n");
                                g_net_status = NET_STATUS_CONNECTING;
                                subscribed = 0;
                                break;
                            }
                        } else {
                            UsartPrintf(USART1, "[Upload] OK\r\n");
                        }
                    }
                }
                // ★★★ 每 STATS_PRINT_INTERVAL_MS打印一次断线统计 ★★★
                static TickType_t last_stat_print = 0;
                now = xTaskGetTickCount();
                if (now - last_stat_print > pdMS_TO_TICKS(STATS_PRINT_INTERVAL_MS)) {
                    last_stat_print = now;
                    UsartPrintf(USART1, "\r\n========== Link Stats ==========\r\n");
                    UsartPrintf(USART1, "[Stats] WiFi lost: %d\r\n", g_wifi_lost_count);
                    UsartPrintf(USART1, "[Stats] PINGRESP timeout: %d\r\n", g_mqtt_pingresp_timeout);
                    UsartPrintf(USART1, "[Stats] MQTT reconnect: %d\r\n", g_mqtt_reconnect_count);
                    UsartPrintf(USART1, "================================\r\n");
                }
                break;
            
            /* ============================================================
             * 异常状态：复位到 DISCONNECTED
             * ============================================================ */
            default:
                UsartPrintf(USART1, "[WiFi] Unknown state, reset to DISCONNECTED\r\n");
                g_net_status = NET_STATUS_DISCONNECTED;
                break;
        }
    }
}
#if DEBUG_MONITOR_ENABLE
void Monitor_Task(void *pvParameters)
{
    char stats_buffer[512];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(5000));

        // ========== 1. 内存和栈水位 ==========
        UsartPrintf(USART1, "\r\n[Monitor] Heap: %d bytes\r\n", xPortGetFreeHeapSize());
        UsartPrintf(USART1, "[Monitor] WiFi stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(xNetworkTaskHandle));
        UsartPrintf(USART1, "[Monitor] Parser stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(xParserTaskHandle));
        UsartPrintf(USART1, "[Monitor] Sensor stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(xSensorTaskHandle));
        UsartPrintf(USART1, "[Monitor] Monitor stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(NULL));
        UsartPrintf(USART1, "[Monitor] Display stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(xDisplayTaskHandle));
        UsartPrintf(USART1, "[Monitor] Key stack: %d\r\n",
                    uxTaskGetStackHighWaterMark(xKeyTaskHandle));
        
        // ========== 2. 任务运行时间统计 ==========
        vTaskGetRunTimeStats(stats_buffer);
        UsartPrintf(USART1, "\r\n========== Run Time Stats ==========\r\n");
        UsartPrintf(USART1, "%s\r\n", stats_buffer);
        UsartPrintf(USART1, "====================================\r\n");
    }
}
#endif

/**
 * @brief OneNET 下行指令处理函数
 * 
 * @param topic   消息主题（应为属性设置 Topic）
 * @param payload 消息内容（JSON 格式）
 * @param len     消息长度
 * 
 * @note 职责：
 *       1. 解析 OneNET 下发的 JSON 指令
 *       2. 控制硬件（LED、蜂鸣器）
 *       3. 更新全局状态 g_sensorData
 *       4. 回复云端确认
 * 
 * @note 支持的指令格式：
 *       {"id":"123","params":{"LED":true,"BEEP":false}}
 * 
 * @note 处理流程：
 *       1. 检查 Topic 是否为属性设置
 *       2. 解析 JSON
 *       3. 获取 params 对象
 *       4. 解析 LED 控制
 *       5. 解析 BEEP 控制
 *       6. 回复云端 {"id":"xxx","code":200,"msg":"success"}
 *       7. 释放 JSON 内存
 * 
 * @note 注意：
 *       - 回复失败不影响功能，不触发重连
 *       - 该函数由 ESP8266_MQTT_ParserTask 调用
 */
void OneNET_ProcessCommand(char *topic, char *payload, uint16_t len)
{
    cJSON *json = NULL;
    cJSON *params_json = NULL;
    cJSON *led_json = NULL;
    cJSON *beep_json = NULL;
    cJSON *id_json = NULL;
    char reply_buf[128];
    
    UsartPrintf(USART1, "\r\n[OneNET] ===== Process Command =====\r\n");
    UsartPrintf(USART1, "[OneNET] Topic: %s\r\n", topic);
    UsartPrintf(USART1, "[OneNET] Payload: %s\r\n", payload);
    
    // ★ 1. 检查 Topic 是否是属性设置
    if (strcmp(topic, TOPIC_PROPERTY_SET) != 0) {
        UsartPrintf(USART1, "[OneNET] Not property set topic, ignore\r\n");
        return;
    }
    UsartPrintf(USART1, "[OneNET] Payload HEX: ");
    for (int i = 0; i < len + 5; i++) {   // ★ 多打印 5 个字节，看后面是什么
        UsartPrintf(USART1, "%02X ", payload[i]);
    }
    UsartPrintf(USART1, "\r\n");
    // ★ 2. 解析 JSON
    json = cJSON_Parse(payload);
    if (json == NULL) {
        UsartPrintf(USART1, "[OneNET] JSON parse error!\r\n");
        return;
    }
    
    // ★ 3. 获取 params 对象
    params_json = cJSON_GetObjectItem(json, "params");
    if (params_json == NULL) {
        UsartPrintf(USART1, "[OneNET] No 'params' field\r\n");
        cJSON_Delete(json);
        return;
    }
    
    // ★ 4. 解析 LED 控制
    led_json = cJSON_GetObjectItem(params_json, "LED");
    if (led_json != NULL) {
        if (led_json->type == cJSON_True) {
            // LED 亮
            LED1 = LED_ON;
            // ★★★ 更新全局状态 ★★★
            if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensorData.led_flag = 1;
                xSemaphoreGive(g_dataMutex);
            }
            UsartPrintf(USART1, "[OneNET] LED ON\r\n");
        } else if (led_json->type == cJSON_False) {
            // LED 灭
            LED1 = LED_OFF;
             // ★★★ 更新全局状态 ★★★
            if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensorData.led_flag = 0;
                xSemaphoreGive(g_dataMutex);
            }
        
            UsartPrintf(USART1, "[OneNET] LED OFF\r\n");
        } else {
            UsartPrintf(USART1, "[OneNET] LED value is not boolean\r\n");
        }
    } else {
        UsartPrintf(USART1, "[OneNET] No 'LED' field\r\n");
    }
    // ★★★ 5. 解析 BEEP 控制（照写 LED） ★★★
    beep_json = cJSON_GetObjectItem(params_json, "Alarm");
    if (beep_json != NULL) {
        if (beep_json->type == cJSON_True) {
            // 蜂鸣器开
            BEEP = BEEP_ON;   // ★ 根据你的硬件修改
            if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensorData.alarm_flag = 1;
                xSemaphoreGive(g_dataMutex);
            }
            UsartPrintf(USART1, "[OneNET] BEEP ON\r\n");
        } else if (beep_json->type == cJSON_False) {
            // 蜂鸣器关
            BEEP = BEEP_OFF;
            if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensorData.alarm_flag = 0;
                xSemaphoreGive(g_dataMutex);
            }
            UsartPrintf(USART1, "[OneNET] BEEP OFF\r\n");
        } else {
            UsartPrintf(USART1, "[OneNET] BEEP value is not boolean\r\n");
        }
    } else {
        UsartPrintf(USART1, "[OneNET] No 'BEEP' field\r\n");
    }
    // ★ 6. 回复云端（可选）
    id_json = cJSON_GetObjectItem(json, "id");
    if (id_json != NULL && id_json->type == cJSON_String) {
        char *id = id_json->valuestring;
        UsartPrintf(USART1, "[OneNET] ID: %s\r\n", id);
        
        // 构建回复 JSON
        memset(reply_buf, 0, sizeof(reply_buf));
        sprintf(reply_buf, "{\"id\":\"%s\",\"code\":200,\"msg\":\"success\"}", id);
        
