liuchaoyuliu/stm32-onenet-iot/user/main.c
        // ★★★ 检查返回值 ★★★
        if (ESP8266_MQTT_Publish(Topic_property_set_reply, reply_buf, 0)) {
            UsartPrintf(USART1, "[OneNET] Reply OK\r\n");
        } else {
            UsartPrintf(USART1, "[OneNET] Reply FAILED\r\n");
            // 回复失败不影响功能，不触发重连
        }
    }
    
    // ★ 7. 释放 JSON 内存
    cJSON_Delete(json);
    
    UsartPrintf(USART1, "[OneNET] ===== Process Done =====\r\n");
}
/**
 * @brief MQTT 解析任务（处理 CONNACK / PUBLISH / PINGRESP）
 */
/**
 * @brief MQTT 解析任务（处理 CONNACK / PUBLISH / PINGRESP / SUBACK）
 * 
 * @param pvParameters 未使用
 * 
 * @note 职责：
 *       1. 从 MQTT 队列读取数据
 *       2. 解析 MQTT 包类型
 *       3. 根据包类型执行对应操作
 *       4. 维护心跳时间和连接状态
 * 
 * @note 处理的包类型：
 *       - CONNACK：连接确认 → 设置 CONNECTED 状态，重置退避时间
 *       - PUBLISH：云端下发指令 → 调用 OneNET_ProcessCommand
 *       - PINGRESP：心跳回应 → 刷新心跳时间，重置退避时间
 *       - SUBACK：订阅确认 → 设置 subscribed = 1
 * 
 * @note 数据流：
 *       ESP8266 → USART2 → IDLE中断 → MQTT队列 → ParserTask → 业务处理
 * 
 * @note 心跳维护：
 *       收到任何 MQTT 包都刷新 g_last_ping_resp_time
 *       防止因 PINGRESP 丢失导致误判断线
 */

void ESP8266_MQTT_ParserTask(void *pvParameters)
{
    ESP8266_Msg_t msg;                  // MQTT 消息结构体（从队列读取）
    uint8_t *cmd;                       // 指向 MQTT 包数据的指针
    uint16_t dataLen;                   // MQTT 包数据长度
    uint8_t packet_type;                // MQTT 包类型
    
    char payload[256];                  // 载荷缓冲区（预留）
    uint16_t payload_len;               // 载荷长度（预留）
    char *req_payload = NULL;           // 解析出的载荷指针
    char *cmdid_topic = NULL;           // 解析出的 Topic 指针
    
    unsigned short topic_len = 0;       // Topic 长度
    unsigned short req_len = 0;         // 载荷长度
    
    unsigned char type = 0;             // 包类型（预留）
    unsigned char qos = 0;              // QoS 等级
    static unsigned short pkt_id = 0;   // 包 ID
    
    UsartPrintf(USART1, "[MQTT_Parser] Started\r\n");
    
    // ★★★ 初始化最后心跳时间（防止刚上电就超时） ★★★
    g_last_ping_resp_time = xTaskGetTickCount();
    
    while(1)
    {
        // ★ 阻塞等待 MQTT 队列数据（不占用 CPU）
        if (ESP8266_GetMQTTMsg(&msg, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        
        // ★ 去掉 +IPD 前缀，提取实际 MQTT 数据
        char *ipd = strstr((char*)msg.data, "+IPD,");
        if (ipd != NULL) {
            // ★ 找到冒号，跳过 "+IPD,<len>:" 前缀
            char *colon = strchr(ipd, ':');
            if (colon != NULL) {
                cmd = (uint8_t*)(colon + 1);                    // 指向数据起始
                dataLen = msg.len - (cmd - msg.data);           // 计算数据长度
            } else {
                cmd = msg.data;
                dataLen = msg.len;
            }
        } else {
            // ★ 没有 +IPD 前缀，直接用原始数据
            cmd = msg.data;
            dataLen = msg.len;
        }
        
        // ★ 数据长度为 0，跳过
        if (dataLen == 0) continue;
        
        // ★ 识别 MQTT 包类型（高 4 位）
        packet_type = MQTT_UnPacketRecv(cmd);
        
        switch(packet_type)
        {
            /* ============================================================
             * CONNACK：连接确认
             * ============================================================ */
            case MQTT_PKT_CONNACK:
                if (MQTT_UnPacketConnectAck(cmd) == 0) {
                    // ★ 连接成功
                    UsartPrintf(USART1, "[MQTT] CONNACK OK\n");
                    // ★ 刷新心跳时间
                    g_last_ping_resp_time = xTaskGetTickCount();
                    // ★ 切换状态为 CONNECTED
                    g_net_status = NET_STATUS_CONNECTED;
                    // ★ 重置退避时间
                    g_reconnect_delay = 5;
                    // ★ 重置订阅标志（重连后需要重新订阅）
                    subscribed = 0;
                } else {
                    // ★ 连接被拒绝
                    UsartPrintf(USART1, "[MQTT] CONNACK REFUSED\n");
                    g_net_status = NET_STATUS_CONNECTING;
                }
                break;
                
            /* ============================================================
             * PUBLISH：云端下发指令
             * ============================================================ */
            case MQTT_PKT_PUBLISH:
                // ★★★ 收到 PUBLISH 也刷新心跳时间 ★★★
                g_last_ping_resp_time = xTaskGetTickCount();
                
                if (MQTT_UnPacketPublish(cmd, &cmdid_topic, &topic_len, &req_payload, &req_len, &qos, &pkt_id) == 0) {
                    // ★ 解析成功，打印 Topic 和载荷
                    UsartPrintf(USART1, "[MQTT] PUBLISH: %s\n", cmdid_topic);
                    UsartPrintf(USART1, "[MQTT] Payload: %s\n", req_payload);
                    
                    // ★★★ 调用业务处理函数 ★★★
                    OneNET_ProcessCommand(cmdid_topic, req_payload, req_len);
                    
                    // ★ 释放内存（MQTT_UnPacketPublish 动态分配了内存）
                    MQTT_FreeBuffer(cmdid_topic);
                    MQTT_FreeBuffer(req_payload);
                }
                break;
                
            /* ============================================================
             * PINGRESP：心跳回应
             * ============================================================ */
            case MQTT_PKT_PINGRESP:
                // ★★★ 收到心跳回应，刷新时间戳 ★★★
                g_last_ping_resp_time = xTaskGetTickCount();
                UsartPrintf(USART1, "[MQTT] PINGRESP received\n");
                // ★ 重置退避时间
                g_reconnect_delay = 5;
                // ★ 确保状态是 CONNECTED
                if (g_net_status != NET_STATUS_CONNECTED) {
                    g_net_status = NET_STATUS_CONNECTED;
                }
                break;
                
            /* ============================================================
             * SUBACK：订阅确认
             * ============================================================ */
            case MQTT_PKT_SUBACK:
                UsartPrintf(USART1, "[MQTT] SUBACK received\n");
                // ★★★ 订阅成功 ★★★
                subscribed = 1;
                // ★ 刷新心跳时间
                g_last_ping_resp_time = xTaskGetTickCount();
                // ★ 重置退避时间
                g_reconnect_delay = 5;
                // ★ 确保状态是 CONNECTED
                if (g_net_status != NET_STATUS_CONNECTED) {
                    g_net_status = NET_STATUS_CONNECTED;
                }
                break;
                
            /* ============================================================
             * 其他包类型：忽略
             * ============================================================ */
            default:
                break;
        }
    }
}
/**
 * @brief DHT11 温湿度传感器采集任务
 * 
 * @param pvParameters 未使用
 * 
 * @note 职责：
 *       1. 初始化 DHT11 传感器
 *       2. 每 SENSOR_INTERVAL_MS 毫秒采集一次温湿度
 *       3. 更新全局数据 g_sensorData
 * 
 * @note 采集流程：
 *       1. 调用 DHT11_Read_Data 读取温湿度
 *       2. 读取成功：更新 g_sensorData.temp_int 和 humi_int
 *       3. 读取失败：打印错误，等待下次采集
 * 
 * @note 数据保护：
 *       更新 g_sensorData 时使用互斥锁 g_dataMutex
 *       防止与 Upload_Task 竞争
 * 
 * @note 注意事项：
 *       - DHT11 最小采集周期 1 秒，这里用 5 秒
 *       - 读取时使用 TIM4 独立延时，不依赖 SysTick
 *       - 任务优先级设为 configMAX_PRIORITIES - 2（较高）
 */
void Sensor_Task(void *pvParameters)
{
    // ★ 温湿度变量（DHT11 返回整数）
    u8 temp, humi;
    
    // ★ 初始化 DHT11（配置 GPIO + 延时定时器）
    DHT11_Init();
    
    // ★ 等待 DHT11 上电稳定（2 秒）
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    UsartPrintf(USART1, "[Sensor] DHT11 Task started\r\n");
    
    while (1) {
        
        // ★★★ 读取 DHT11 温湿度 ★★★
        // 返回值：0 = 成功，1 = 失败
        u8 result = DHT11_Read_Data(&temp, &humi);
        
        if (result == 0) {
            // ★ 读取成功，打印温湿度
            UsartPrintf(USART1, "[Sensor] Temp=%d, Hum=%d\r\n", temp, humi);
            
