liuchaoyuliu/stm32-onenet-iot/user/main.c
            // ★★★ 更新全局数据（加锁保护） ★★★
            if (xSemaphoreTake(g_dataMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensorData.temp_int = temp;                            // 温度
                g_sensorData.humi_int = humi;                            // 湿度
                g_sensorData.led_flag = (LED1 == LED_ON) ? 1 : 0;        // LED 状态
                g_sensorData.alarm_flag =(BEEP == BEEP_ON) ? 1: 0;       // 蜂鸣器状态
                xSemaphoreGive(g_dataMutex);
            }
        } else {
            // ★ 读取失败，打印错误
            UsartPrintf(USART1, "[Sensor] Read failed\r\n");
        }
        
        // ★ 等待 SENSOR_INTERVAL_MS 毫秒后再次采集
        vTaskDelay(pdMS_TO_TICKS(SENSOR_INTERVAL_MS));
    }
}
int main(void)
{
    System_Init();
    
    LCD_Clear(WHITE);
    LCD_ShowChineseString16(10, 10, "FreeRTOS温控", BLACK);
    LCD_ShowString(150, 10, 200, 24, 24, (u8*)"v1.0");
    LCD_ShowString(10, 50, 200, 16, 16, (u8*)"Connecting...");
     // ★ 创建互斥锁
    g_dataMutex = xSemaphoreCreateMutex();
    if (g_dataMutex == NULL) {
        while(1);
    }
    xTaskCreate(Network_Task, "WiFi", 576, NULL, 2, &xNetworkTaskHandle);
    xTaskCreate(ESP8266_MQTT_ParserTask, "Parser", 500, NULL, 2, &xParserTaskHandle);
    xTaskCreate(Sensor_Task, "Sensor", 256, NULL, configMAX_PRIORITIES - 2, &xSensorTaskHandle);//优先级设置高点，防止打乱读取时序
    #if DEBUG_MONITOR_ENABLE
    xTaskCreate(Monitor_Task, "Monitor", 512, NULL, 1, NULL);  // 最低优先级
    #endif
    xTaskCreate(Display_Task, "Display", 512, NULL, 1,&xDisplayTaskHandle);   // ★ 新增
    xTaskCreate(Key_Task, "Key", 256, NULL, 1, &xKeyTaskHandle);           // ★ 新增
    vTaskStartScheduler();
    while(1);
}

